In [1]:
import pandas as pd
df = pd.read_csv('/Users/masato/Documents/GitHub/ML_Practice/CSV/ex4.csv')
df.head(3)

   class  dept_id  sex      score
0      3        0    1  60.170169
1      3        5    1  86.610078
2      2        6    1  69.761279

In [15]:
male = df['sex'].sum()
total = len(df)
male/total

0.5133333333333333

In [17]:
df.groupby('class').mean()['score']

class
0    68.850195
1    69.510764
2    71.611092
3    67.572909
4    68.814253
Name: score, dtype: float64

In [18]:
pd.pivot_table(df, index = 'class', columns = 'sex', values = 'score')

sex            0          1
class
0      68.358569  69.274011
1      67.472218  71.379432
2      71.704884  71.532109
3      63.897676  72.013815
4      69.952314  67.676191